VV_cases/V2_thermal/_code/templates/base_case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

nu              1.516e-05;

beta            3.412e-03;

TRef            293.15;

Pr              0.713;

Prt             0.9;
